s --> np, vp.
np -->pron_lexicon; noun_lexicon; art_lexicon, noun_lexicon.
vp -->verb_lexicon; verb_lexicon, np.

%λεξικο

verb_lex(παιζ, ενεργιτική, ενεστώτας, οριστική, α,
    [β, εις, ει, ουμε, ετε, ουν]).
noun_lexicon(παιδ, ουδέτερο, ισοσύλλαβο, λήγουσα,[[ί, ιού, ί, ί], [ιά, ιών, ιά, ιά]]).
noun_lexicon(ποδόσφαιρ,ουδέτερο,ισοσύλλαβο, παραλήγουσα, [[ο, ου, ο, ο], [α, ων, α, α]]).

adjective_lexicon(μικρ, [όσ, ή, ό],ισοσύλλαβα,
    [[[ος,ου,ος,ος],[οι,ων,οι,ος]],
    [[η,ης,η,η],[ες,ων,ες,ες]],
    [[ο,ου,ο,ο],[α,ων,α,α]]],
    κατάληξη).
 

verb_lexicon(παιζ).